#pragma once
#include <DirectXMath.h>
#include "Math/Mathf.h"

class Matrix4x4 :
	public DirectX::XMFLOAT4X4
{
public:
	Matrix4x4()
	{
		_11 = 1.0f; _12 = 0.0f; _13 = 0.0f; _14 = 0.0;
		_21 = 0.0f; _22 = 1.0f; _23 = 0.0f; _24 = 0.0;
		_31 = 0.0f; _32 = 0.0f; _33 = 1.0f; _34 = 0.0;
		_41 = 0.0f; _42 = 0.0f; _43 = 0.0f; _44 = 1.0;
	}

	//===========================================
	//
	//		静的メンバ変数
	//
	//===========================================

	static const Matrix4x4 identity;	// 恒等行列
	static const Matrix4x4 zero;		// 全ての要素を0にした行列


	//===========================================
	//
	//	  演算子
	//
	//===========================================


};

